tests/helper_tests/mocks/invoice_mock_2_2month_later_half.json

{
  "id": "in_1NgTBZDc6Ds2E1iCdOT6B20b",
  "object": "invoice",
  "account_country": "DE",
  "account_name": "Memberspot GmbH",
  "account_tax_ids": ["atxi_1HZyfaDc6Ds2E1iCwoDJa0Km"],
  "amount_due": 455818,
  "amount_paid": 455818,
  "amount_remaining": 0,
  "amount_shipping": 0,
  "application": null,
  "application_fee_amount": null,
  "attempt_count": 1,
  "attempted": true,
  "auto_advance": false,
  "automatic_tax": {
    "enabled": false,
    "status": null
  },
  "billing_reason": "subscription_create",
  "charge": "ch_3NgTBZDc6Ds2E1iC3kMlBup0",
  "collection_method": "charge_automatically",
  "created": 1692367077,
  "currency": "eur",
  "custom_fields": null,
  "customer": "cus_OTQ1FjXijLMcIG",
  "customer_address": {
    "city": "ee",
    "country": "DE",
    "line1": "ee",
    "line2": "",
    "postal_code": "ee",
    "state": null
  },
  "customer_email": "johannes@memberspot.de",
  "customer_name": "eee",
  "customer_phone": null,
  "customer_shipping": null,
  "customer_tax_exempt": "none",
  "customer_tax_ids": [],
  "default_payment_method": null,
  "default_source": null,
  "default_tax_rates": [
    {
      "id": "txr_1GWllXDc6Ds2E1iCBY2dIDXE",
      "object": "tax_rate",
      "active": true,
      "country": null,
      "created": 1586620867,
      "description": null,
      "display_name": "Umsatzsteuer",
      "effective_percentage": null,
      "inclusive": false,
      "jurisdiction": null,
      "livemode": false,
      "metadata": {},
      "percentage": 19.0,
      "state": null,
      "tax_type": null
    }
  ],
  "description": null,
  "discount": null,
  "discounts": [],
  "due_date": null,
  "effective_at": 1692367077,
  "ending_balance": 0,
  "footer": null,
  "from_invoice": null,
  "hosted_invoice_url": "url",
  "invoice_pdf": "pdflink",
  "last_finalization_error": null,
  "latest_revision": null,
  "lines": {
    "object": "list",
    "data": [
      {
        "id": "il_1NgTBZDc6Ds2E1iChNSGFwnr",
        "object": "line_item",
        "amount": 383040,
        "amount_excluding_tax": 383040,
        "currency": "eur",
        "description": "1 × Premium-V3 (at €3,830.40 / year)",
        "discount_amounts": [],
        "discountable": true,
        "discounts": [],
        "livemode": false,
        "metadata": {},
        "period": {
          "end": 1723989477,
          "start": 1692367077
        },
        "plan": {
          "id": "price_1NcSRlDc6Ds2E1iCD5OExWXS",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 383040,
          "amount_decimal": "383040",
          "billing_scheme": "per_unit",
          "created": 1691410925,
          "currency": "eur",
          "interval": "year",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "nickname": "Premium V3 jährl.",
          "product": "prod_OPGzg63nRzSI2z",
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "price": {
          "id": "price_1NcSRlDc6Ds2E1iCD5OExWXS",
          "object": "price",
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1691410925,
          "currency": "eur",
          "custom_unit_amount": null,
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": "Premium V3 jährl.",
          "product": "prod_OPGzg63nRzSI2z",
          "recurring": {
            "aggregate_usage": null,
            "interval": "year",
            "interval_count": 1,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "tax_behavior": "unspecified",
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "recurring",
          "unit_amount": 383040,
          "unit_amount_decimal": "383040"
        },
        "proration": false,
        "proration_details": {
          "credited_items": null
        },
        "quantity": 1,
        "subscription": "sub_1NgTBZDc6Ds2E1iCOmyTXekk",
        "subscription_item": "si_OTQ1UXCxrmynC4",
        "tax_amounts": [
          {
            "amount": 72778,
            "inclusive": false,
            "tax_rate": "txr_1GWllXDc6Ds2E1iCBY2dIDXE",
            "taxability_reason": null,
            "taxable_amount": 383040
          }
        ],
        "tax_rates": [],
        "type": "subscription",
        "unit_amount_excluding_tax": "383040"
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/invoices/in_1NgTBZDc6Ds2E1iCdOT6B20b/lines"
  },
  "livemode": false,
  "metadata": {},
  "next_payment_attempt": null,
  "number": "194C2584-3320",
  "on_behalf_of": null,
  "paid": true,
  "paid_out_of_band": false,
  "payment_intent": "pi_3NgTBZDc6Ds2E1iC3tr8IrM1",
  "payment_settings": {
    "default_mandate": null,
    "payment_method_options": null,
    "payment_method_types": null
  },
  "period_end": 1692367077,
  "period_start": 1692367077,
  "post_payment_credit_notes_amount": 238000,
  "pre_payment_credit_notes_amount": 0,
  "quote": null,
  "receipt_number": null,
  "rendering": null,
  "rendering_options": null,
  "shipping_cost": null,
  "shipping_details": null,
  "starting_balance": 0,
  "statement_descriptor": null,
  "status": "paid",
  "status_transitions": {
    "finalized_at": 1692367077,
    "marked_uncollectible_at": null,
    "paid_at": 1692367079,
    "voided_at": null
  },
  "subscription": "sub_1NgTBZDc6Ds2E1iCOmyTXekk",
  "subscription_details": {
    "metadata": {}
  },
  "subtotal": 383040,
  "subtotal_excluding_tax": 383040,
  "tax": 72778,
  "test_clock": null,
  "total": 455818,
  "total_discount_amounts": [],
  "total_excluding_tax": 383040,
  "total_tax_amounts": [
    {
      "amount": 72778,
      "inclusive": false,
      "tax_rate": "txr_1GWllXDc6Ds2E1iCBY2dIDXE",
      "taxability_reason": null,
      "taxable_amount": 383040
    }
  ],
  "transfer_data": null,
  "webhooks_delivered_at": 1692367081
}
